{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.3/4"
      ],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2018-2021",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SiddarthKrishnan",
  "highlighted_projects": [
    {
      "description": "Our goal was to create a machine learning model (neural network architecture) to identify objects by a class label. We wanted to understand why deep learning was preferable for computer vision tasks. We used Python and tensorflow along with a transfer learning approach, adapting a prefined CNN for our dataset. We had a hard time achieving classification lower than standard benchmarks for the R-CNN models. We could have focused more on preprocessing data and adjusting the network through drop layers. We also should have read more literature on networks for image classification as we were unable to correct overfitting and accuracy issues in the given time.",
      "git_url": "",
      "name": "Machine learning object recognition assignment"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring program using Bash scripts and PostgreSQL for a Linux cluster to track hardware usage statistics, such as CPU, RAM, and disk. Linux servers are connected locally, and the script periodically populates a table with each node's current usage information. It was apparent that virtual memory comprises process info, memory, CPU scheduling and other statistics. Logging memory statistics was a good exercise in understanding file partitions, which manage storage space on the OS. SQL statements were embedded in our bash scripts to initialize tables inside a docker container running Postgres. We chose to run our database in docker because of its convenience for development. Lastly, we made sure to add the script that tracks host usage in our crontab because this is information that we need periodically.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In the process of making CRUD app for Twitter to learn APIs.",
        "JDBC App: Used JDBC to access database from the RDBMS to abstract CRUD operations. Used the data access object (DAO) pattern in code to execute SQL statements. The DAO pattern along with java.sql api were used in implementation to perfrom operations on an existing database. Our DAO classes hides how objects are persisted in the database. I also explored another the repository pattern and its advantages in this small project.",
        "Grep App: Implemented the bash grep function in a java application. This app made use of java regex classes and file handling to test its usage for text files.",
        "Twitter App: Currently working on CRUD app for Twitter to learn APIs. Using HTTP and json within java.",
        "JDBC App: Implemented one instance of the data persistence layer for a relational database. The client-side JDBC package java.sql was used to access RDBMS to abstract CRUD operations. The data access object (DAO) pattern was followed in java class files to execute SQL statements. The DAO pattern along with java.sql api was used in implementation to perform operations on an existing database of customers and orders. Our DAO class hides how orders are persisted in the database but can return an order using the java.sql ResultSet. I also studied the repository pattern and its advantages in this assignment.",
        "Grep App: Reimplemented the bash grep command in a java application. This app made use of java regex classes and file handling to test its usage for text files. The testing was done by appending lines with matching regex patterns to a single file. Furthermore, the class files and dependencies were packaged in an uber jar using maven and its shade plugin. This ensured that the JVM would find class files in both our classpath and pom file dependencies. The project was finally dockerized using a dockerfile to build the image."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_SiddarthKrishnan/tree/master/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Siddarth Krishnan",
  "others": [
    {
      "bullets": [
        "Receational sports",
        "Defi research",
        "Math"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Gaining experience with many development tools and programming paradigms. Currently working in a scrum team and developing applications with linux/sql and Java. As a scrum team lead, I work with in the same role and team members while also leading meetings and keeping track of individuals' progress and impediments to success. This role involves meeting deadlines for application development and demonstrating technical acumen in code reviews upon finishing a project. I am also involved in sprint retrospectives that give our team the opportunity to evaluate our performance and discuss imrpovements or strategies for the next sprint.",
      "duration": "2021-present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Cineplex",
      "description": "Guest services role. Worked in concession area serving food and preparing orders. Checked vaccine certificates for all theatre entrants. Closing and opening duties.",
      "duration": "2021-present",
      "title": "Cast Member"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "C++",
      "Smalltalk",
      "Docker",
      "Javascript"
    ],
    "familiar": [
      "PyTorch",
      "React",
      "Vue",
      "MATLAB",
      "Rust"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Microsoft Office"
    ]
  },
  "summary": "I'm a recent computer science graduate passionate about software development, machine learning, and advances in the crypto space like decentralized finance. My excitement comes from seeing how we can identify patterns in big data sets using deep learning and different neural network architectures. In addition, I've been paying close attention to decentralized protocols and how developers have gamified finance on Web3. I enjoy developing software, exploring math behind algorithms, and practicing object oriented styles of programming. I want to learn more about how data moves in and out of applications securely and efficiently."
}
